servers/mac-swiftmac/Design.org
* Design

The server intends to provide primitives to support all the features used by
emacspeak and swiftmac-voices.el.


** Supported Commands

These are the commands sent via stdin and on thier own line.

- =a=: queue audio icon
- =c=: queue code
- =d=: dispatch queue
- =l=: instant letter
- =p=: instant audio icon
- =q=: queue speech
- =s=: stop all (confirm with list)_
- =sh=: queue silence
- =t=: queue tone
- =tts_pause=: instant pause speech engine (should stop?)
- =tts_reset=: queue reset (to defaults?)
- =tts_resume=: instant resume speech engine
- =tts_say=: instant say no additional tweaking
- =tts_set_character_scale=: queue char scale change
- =tts_set_punctuations=: queue punct change
- =tts_set_speech_rate=: queue rate change
- =tts_split_caps=: queue split caps change
- =tts_sync_state=: [decomp] queue multiple settings change
- =version=: [decomp] say tts version

Not Implemented yet:
- =set_next_lang=:
- =set_previous_lang=:
- =set_lang=
- =set_preferred_lang=


Engine Specific:
- =tts_exit=: instant exit
- =tts_set_pitch_multiplier=: .5 to 2 pitch multiplier
- =tts_set_sound_volume=: 0 to 1 (1 being 100% sound volume)
- =tts_set_tone_volume=: 0 to 1 (1 being 100% tone volume)
- =tts_set_voice=: queue voice change
- =tts_set_voice_volume=: 0 to 1 (1 being 100% voice volume)

Broken:
- =tts_allcaps_beep=: queue caps beep change, setting only works on typing
  input


** Supported Embeddings

These are converted by the preprocessor into tts_ commands.

- [*] - queue silence in place of this
