servers/mac-swiftmac/Design.tex
% Created 2024-04-17 Wed 14:48
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Robert Melton}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Robert Melton},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Design}
\label{sec:org5cf9dd6}

The server intends to provide primitives to support all the features used by
emacspeak and swiftmac-voices.el.


\subsection{Supported Commands}
\label{sec:orgc5ff25e}

These are the commands sent via stdin and on thier own line.

\begin{itemize}
\item \texttt{a}: queue audio icon
\item \texttt{c}: queue code
\item \texttt{d}: dispatch queue
\item \texttt{l}: instant letter
\item \texttt{p}: instant audio icon
\item \texttt{q}: queue speech
\item \texttt{s}: stop all (confirm with list)\_
\item \texttt{sh}: queue silence
\item \texttt{t}: queue tone
\item \texttt{tts\_pause}: instant pause speech engine (should stop?)
\item \texttt{tts\_reset}: queue reset (to defaults?)
\item \texttt{tts\_resume}: instant resume speech engine
\item \texttt{tts\_say}: instant say no additional tweaking
\item \texttt{tts\_set\_character\_scale}: queue char scale change
\item \texttt{tts\_set\_punctuations}: queue punct change
\item \texttt{tts\_set\_speech\_rate}: queue rate change
\item \texttt{tts\_split\_caps}: queue split caps change
\item \texttt{tts\_sync\_state}: [decomp] queue multiple settings change
\item \texttt{version}: [decomp] say tts version
\end{itemize}

Not Implemented yet:
\begin{itemize}
\item \texttt{set\_next\_lang}:
\item \texttt{set\_previous\_lang}:
\item \texttt{set\_lang}
\item \texttt{set\_preferred\_lang}
\end{itemize}


Engine Specific:
\begin{itemize}
\item \texttt{tts\_exit}: instant exit
\item \texttt{tts\_set\_pitch\_multiplier}: .5 to 2 pitch multiplier
\item \texttt{tts\_set\_sound\_volume}: 0 to 1 (1 being 100\% sound volume)
\item \texttt{tts\_set\_tone\_volume}: 0 to 1 (1 being 100\% tone volume)
\item \texttt{tts\_set\_voice}: queue voice change
\item \texttt{tts\_set\_voice\_volume}: 0 to 1 (1 being 100\% voice volume)
\end{itemize}

Broken:
\begin{itemize}
\item \texttt{tts\_allcaps\_beep}: queue caps beep change, setting only works on typing
input
\end{itemize}


\subsection{Supported Embeddings}
\label{sec:org6e92d40}

These are converted by the preprocessor into tts\_ commands.

\begin{itemize}
\item\relax [*] - queue silence in place of this
\end{itemize}
\end{document}
